graphql-app/app/graphql/types/query_type.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def user(id:)
      User.find(id)